{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"contact","text":"","link":"/contact/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"计算机操作系统","text":"“作业”相当于”程序”，”进程”相当于程序中一段段可并发执行的代码 操作系统(简称OS)：OS是计算机系统最基础的系统软件，管理软硬件资源、控制程序执行，改善人机界面，合理组织计算机工作流程，为用户使用计算机提供良好运行环境操作系统的组成： 进程调度子系统、进程通信子系统、内存管理子系统、设备管理子系统、文件管理子系统、网络通信子系统、作业控制子系统 资源的共享与分配方式： ①资源共享方式：独占使用方式、并发使用方式②资源分配策略： 静态分配方式(在程序运行前事先分配好资源) 动态分配方式(在程序运行中，谁用谁分配资源，可能会产生死锁) 资源抢占方式(设置优先级，优先级高，则随时可使用，不会产生死锁，但需考虑资源回滚) 中断：中断是指程序执行过程中，遇到急需处理的事件时，暂时中止CPU上现行程序的运行，转去执行相应的事件处理程序，待处理完成后再返回源程序被中断处或调度其他程序执行的过程。(中断是激活操作系统的唯一方式) 狭义的中断指来源于处理器之外的中断事件，即与当前运行指令无关的中断事件，如I/O中断、外部信号中断等 异常指当前运行指令引起的中断事件，如地址异常、算数异常、处理器硬件故障等 系统异常指执行陷入指令而触发系统调用引起的中断事件，如请求设备、请求I/O、创建进程等 中断源：处理器硬件故障中断事件、程序性中断事件、自愿性中断事件、I/O中断事件、外部中断事件 程序状态字（Program Status Word, PSW）又称状态寄存器，主要用于反映处理器的状态及某些计算结果以及控制指令的执行。程序状态字通常包括以下状态代码： CPU的工作状态码——指明管态还是目态，用来说明当前在CPU上执行的是操作系统还是一般用户，从而决定其是否可以使用特权指令或拥有其它的特殊权力 条件码——反映指令执行后的结果特征 中断屏蔽码——指出是否允许中断 各标志位的含义如下表格： 进程的概念： 进程是一个具有一定独立功能的程序相关某个数据集合的一次运行活动，也是操作系统进行资源分配和调度的一个独立单位进程包括五个实体： (OS管理运行程序的)数据结构P (运行程序的)内存代码C (运行程序的)内存数据D (运行程序的)通用寄存器信息R (OS控制程序执行的)程序状态字信息PSW 进程挂起：为解决计算机在运行过程中可能出现资源不足(性能低、死锁)，从而剥夺某些进程的内存即其他资源，使其不参加进程调度，挂起态与等待态相比，前者没有任何资源。 进程管理块： 为了描述控制进程的运行，系统中存放进程的管理和控制信息的数据结构称为进程控制块（PCB Process Control Block），它是进程实体的一部分，是操作系统中最重要的记录性数据结构。它是进程管理和控制的最重要的数据结构，每一个进程均有一个PCB，在创建进程时，建立PCB，伴随进程运行的全过程，直到进程撤消而撤消。 关键的进程管理软件： 系统调用/中断/异常处理程序 * 队列管理模块 进程控制程序 * 进程调度程序 进程通信程序 * 作业控制程序等外围程序 队列管理模块： 队列管理模块是操作系统实现进程管理的核心模块 操作系统建立多个进程队列，包括就绪队列和等待队列 按需组织为先进先出队列与优先队列 队列中的进程可以通过PCB中的队列指引元采用单双指引元或索引连接 出队和入队操作 进程与资源调度围绕进程队列展开 进程的控制与管理： 进程创建：进程表加一项，申请PCB并初始化，生成标识，建立映像，分配资源，移入就绪队列 进程撤销：从队列中移除，归还资源，撤销标识，回收PCB，移除进程表项 进程阻塞：保存现场信息，修改PCB，移入等待队列，调度其他进程执行 进程唤醒：等待队列中移除，修改PCB，移入就绪队列 进程挂起：修改状态并出入相关队列，收回内存等资源送至对换区 进程激活：分配内存，修改状态并出入相关队列 其他：如修改进程特权 原语：原语是由若干条指令构成的完成某种特定功能的程序，执行上具有不可分割性 进程控制中涉及对OS核心数据结构的修改，为防止错误，应使用原语。 进程切换：是指进程被某些中断事件中断之后，使其从进行态变成其他状态，在中断事件结束后，切换成其他进程进行。线程(thread)线程是进程的一条执行路径，是调度的基本单位，同一个进程中的所有线程共享进程获得的主存空间和资源。线程具有： 线程执行状态 受保护的线程上下文，当线程不运行时，用于存储现场信息 独立的程序指令计数器 执行堆栈 容纳局部变量的静态存储器 *线程控制块 内核级线程(KLT)的特点： 进程中的一个线程被阻塞了，内核能调度同一进程的其他线程占有处理器运行 多处理器环境，内核能同时调度统一进程中多个线程并行执行 内核自身也可用多线程技术实现，能提高操作系统的执行速度和效率 应用程序线程在用户态运行，线程调度和管理在内核实现，在同一进程中，控制权从一个线程传送到另一个线程时需要模式切换，系统开销较大 用户级线程(ULT)的特点： 所有线程管理数据结构均在进程的用户空间中，线程切换不需要内核模式，能节省模式切换开销和内核的宝贵资源 允许进程按应用特定需要选择调度算法，甚至根据应用需要裁剪调度算法 能运行在任何OS上，内核在支持ULT方面不需要做任何工作 不能利用多处理器的优点，OS调度进程，仅有一个ULT能执行 一个ULT的阻塞，将引起整个进程的阻塞(需调用Jacketing解决) ULT适用于解决逻辑并行性问题， KLT适用于解决物理并行性问题，现实解决问题通常采用混合方式(Process) 处理器调度层次：低级调度、中级调度、高级调度选择处理器调度算法的原则： 资源利用率：使得CPU或其他资源的使用率尽可能高且能够并行工作 响应时间：使交互式用户的响应时间尽可能小，或尽快处理实时任务 周转时间：提交给系统开始到执行完成获得结果为止的这段时间间隔称周转时间，应该使周转时间或平均周转时间尽可能短 吞吐量：单位时间处理的进程数尽可能多 公平性：确保每个用户每个进程获得合理的CPU份额或其他资源份额 （响应比=等待时间/估计计算时间；优先数：使用的频率，高则大） 分级调度算法(多队列策略、反馈循环队列)基本思想： 建立多个不同优先级的就绪进程队列 多个就绪进程队列间按照优先数调度 高优先级就绪进程，分配的时间片短 单个就绪进程队列中进程的优先数和时间片相同 彩票调度算法基本思想：为进程发放针对系统各种资源(如CPU时间)的彩票；当调度程序需要作出决策时，随机选择一张彩票，持有该彩票的进程将获得系统资源，合作进程之间将进行彩票交换主存储器的复用 按照分区复用： 主存划分成多个固定/可变尺寸的分区 一个程序/程序段占用一个分区 按照页架复用： 主存划分成多个固定大小的页架 一个程序/程序段占用多个页架 存储管理的基本模式 单连续存储管理：一维逻辑地址空间的程序占用一个主存固定分区或可变分区 段式存储管理：段式二维逻辑地址空间的程序占用多个主存可变分区 页式存储管理：一维逻辑地址空间的程序占用多个主存页架区 段页式存储管理：段式二维逻辑地址空间的程序占用多个主存页架区 地址转换(又称重定位，即把逻辑地址转换成绝对地址) 静态重定位：在程序装入内存时由装入程序进行地址转换 动态重定位：在CPU执行程序时进行地址转换，依赖于硬件 (比较：存储保护；相加：重定位) 可变分区存储管理 按进程的内存需求来动态划分分区 创建一个进程时，根据进程所需主存量查看主存中是否有足够的连续空闲空间(若有，则按需要量分割一个分区；若无，则令该进程等待主存资源) 由于分区大小按照进程实际需要量来确定，因此分区个数是随机变化的 移动技术(程序浮动技术)用于解决内存外零头页式存储管理的基本原理 分页存储器将主存划分成多个大小相等的页架 受页架尺寸限制，程序的逻辑地址也分成页 不同的页可以放在不同页架中，不需要连续 页表用于维系进程的主存完整性 页式存储管理中的地址页式存储管理的快表 由于每次地址转换必须访问两次主存，降低了存取速度，所以利用Cache存放部分页表，来降低地址转换的代价 快表：存放在高速存储器中的页表部分，快表表项包括(页号，页架号)，这种高速存储器是联想存储器，即按照内容寻址 多道程序环境下的地址转换页式虚拟存储管理(主流存储管理技术)的基本思想 把进程全部页面装入虚拟存储器，执行时先把部分页面装入实际内存，然后，根据执行行为，动态调入不再主存的页，同时进行必要的页面调出，首次只把进程第一页信息装入主存，称为请求页式存储管理 页式虚拟存储管理的页表表项： 主存块号、虚拟地址、实际地址、主存驻留标志、写回标志、保护标志、引用标志、可移动标志 页式虚拟存储管理的地址转换 页面调度 当主存空间已满而又需要装入新页时，页式虚拟存储管理必须按照一定的算法吧已在主存的一些页调出去，选择淘汰页的工作称为页面调度，选择淘汰页的算法称为页面调度算法 页面调度算法如果设计不当，会出现刚被淘汰的页面立即又要调入，并如此反复，这种现象称为抖动或颠簸 多种调度算法 OPT页面调度算法：当要调入新页面时，首先淘汰以后不再访问的页，然后选择距现在最长时间后再访问的页，该算法称Belady算法，又称最佳算法，且只可模拟，不可实现 先进先出FIFO页面调度算法：总是淘汰最先调入主存的那一页 最近最少用LRU页面调度算法：淘汰最近一段时间较久未被访问的那一页，但严格实现的代价大，需要维持特殊队列 最不常用LFU页面调度算法：淘汰最近一段时间内访问次数较少的页面，基于时间间隔中断，并给每一项设置一个计数器，时间间隔中断发生后，所有计数器清0，每访问页1次就给计数器加1，选择计数值最小的页面淘汰 时钟CLOCK页面调度算法：采用循环队列机制构造页面队列，形成了一个类似于钟表面的环形表 内存管理单元MMU：CPU管理虚拟/物理存储器的控制线路，把虚拟地址映射为物理地址，并提供存储保护，必要时确定淘汰页面，其数据结构为反置页表IPT反置页表 针对内存中的每个页架建立一个页表，按照块号排序，其表项包括（正在访问该页架的进程标识。页号及特征位、哈希链指针等），用来完成内存页架到访问进程页号的对应 基于反置页表的地址转换过程 MMU通过哈希表把进程标识和虚页号转换成一个哈希值，指向IPT的一个表目，MMU遍历哈希链找到所需进程的虚页号，该项的索引就是页架号，通过拼接位移便可生成物理地址，若未能找到匹配页表项，说明该页不再内存，产生缺页中断 段式存储管理的基本思想 段式存储管理基于可变分区存储管理实现，一个进程要占用多个分区，硬件需要增加一组用户可见的段地址寄存器(代码段、数据段、堆栈段、附加段)，供地址转换使用，存储管理需要增加设置一个段表，每个段占用一个段表项，包括（段始址、段限长、存储保护、可移动、可扩充等标识位） 段式存储管理的地址转换流程段式虚拟存储管理的基本思想 把进程的所有分段都存放在辅存中，进程运行时先把当前需要的一段或几段装入主存，在执行过程中访问到不在主存的段时再把它们动态装入，段的掉进调出由OS自动实现 段式虚拟存储管理的地址转换段页式存储管理的地址转换段页式虚拟存储管理的地址转换（若无该段则需要更新快表） I/O设备 用于计算机系统与外部世界(用户、其他计算机、设备)的信息交换或存储 I/O操作 内存和外设间的信息传送操作 设备控制器 I/O设备分开设置设备的机械部件和电子部件，电子部件称为设备控制器，系统与设备控制器交互，而非与设备交互，其功能有（接收和识别CPU或通道发来的命令、实现数据交换、发现和记录设备及自身的状态信息、识别设备地址） I/O控制的三种方式 轮询方式 处理器向控制器发送I/O命令，轮询I/O结果，若设备未就绪，则重复测试过程，直至设备就绪，然后再执行内存数据交换，等待I/O操作完成后，处理器才可以继续其他操作 中断方式 处理器向控制器发出具体I/O命令，然后继续执行后续指令（若进程支持异步I/O，后续指令仍可是该进程中的指令，否则，该进程在这个中断上挂起，处理器执行其他工作），控制器检查设备状态，就绪后发出中断，CPU响应中断，进行中断处理，中断处理执行内存数据交换 DMA方式 处理器向DMA模块发出I/O命令，处理器继续执行其他工作，DMA模块负责传送全部数据，数据传送结束后，DMA中端处理器 DMA方式中的周期窃取(因为由于DMA模块会进行数据交换，可能与CPU竞争总线) I/O通道 又称I/O处理器，用于完成逻辑上独立的I/O任务，采用四级连接：处理器、通道、控制器、设备，通道可控制多台设备 工作流程：CPU遇到I/O任务，组织通道程序，置通道程序地址字(CAW)，启动指定通道，通道从CAW获得通道程序，控制I/O设备进行操作，CPU执行其他任务，I/O操作完成后，通道发出中断，CPU处理中断，并从通道程序状态字(CSW)获得通道执行情况，处理I/O操作 南桥与北桥的总线模型 I/O软件的层次结构设置I/O缓冲的目的 解决CPU与设备之间速度不匹配的矛盾 协调逻辑记录大小和物理记录大小不一致的问题 提高CPU和设备的并行性 减少I/O操作对CPU的中断次数 放宽对CPU中断响应时间的要求 设备独立性及其实现 用户通常不指定物理设备，而是指定逻辑设备，使得用户进程和物理设备分离开来，再通过其他途径建立逻辑设备和物理设备之间的映射 独占型外围设备：一次只能由一个进程独占使用 为了设备分配，需要建立一个数据结构 设备表：每类设备都有各自的设备表，用来登记这类设备中的每台物理设备设备类表：每类设备对应设备类表中的一栏 磁盘结构磁盘存取时间 移臂调度及算法 目的：使移动臂的移动时间最短，从而减少寻道总时间 移臂调度算法： 先来先服务：移臂距离大，性能不好 最短查找时间优先(最小短距法)：先执行查找时间最短的请求，具有较好的寻道性能，但存在”饥饿”现象，即若请求处于磁盘边缘，那么响应就会比较慢 移臂调度的扫描算法： 单向扫描：移动臂向一个方向扫描，归途不提供服务，适用于不断均匀分布的大量柱面请求的情形 双向扫描：移动臂每次向一个方向移动，遇到最近的I/O请求便进行处理，到达最后一个柱面后再向相反方向移动 电梯调度：双向扫描的改进，当前移动方向没有访问请求时，就改变移动方向 旋转调度： 目的：使得旋转延迟的总时间最少 优化： 通过优化I/O请求排序，在最少旋转圈数内完成位于同一柱面的访问请求 旋转位置测定硬件和多磁头同时读写 通过信息在存储空间的排列方式来减少旋转延迟，由于磁盘匀速运转，处理当前扇区数据时，可能下一个扇区已经跳过，则可使用交替排序的方式 SPOOLing(Simultaneous Peripheral Operations On-Line,通常称”假脱机技术”)系统的软件组成 预输入程序：预先把数据从输入设备传送到磁盘输入井(缓冲区) 缓输出程序：把数据从磁盘输出井传送到输出设备 井管理程序：控制作业进程和井之间的数据交换(I/O重定向) SPOOLing系统示意图 SPOOLing系统与作业管理多道批处理OS的作业管理 作业说明语言：用于作业控制的语言 作业说明书：刻画具体作业的控制方式 作业状态：输入状态(预输入)、后备状态(空闲)、运行状态(运行)、完成状态(缓输出) 作业调度：从后备状态作业中选择部分进入运行状态(前提是次资源满足) 作业调度算法：优先数、短作业、响应比、设备搭配等 文件的概念 文件是具有符号名的，在逻辑上具有完整意义的一组相关信息项的序列 文件系统的概念 文件系统是操作系统中负责存取和管理信息的模块，它用统一的方式管理用户和系统信息的存储、检索、更新、共享和保护，并为用户提供一整套方便有效的文件使用和操作方式 文件系统的功能 面向用户的功能： 文件的按名存取 文件的共享和保护 文件的操作和使用 OS的功能 文件目录的建立和维护 存储空间的分配和回收 数据的保密和保护 监督用户存取和修改文件的权限 实现在不同存储介质上的信息的表示方式、编址方法、存储次序、信息检索等问题 文件系统的组成卷和块 卷是存储介质的物理单位，对应于一盘磁带、一块软盘、一个光盘片、一个硬盘分区 块是存储介质上连续信息所组成的一个区域，也叫做物理记录(如硬盘中的扇区) 块是主存储器和辅助存储器进行信息交换的物理单位，每次交换总是一块或整数块信息，不同类型的存储介质的块的长短常常各不相同，同种类型一般是相同的，但也可以不同，块与块之间必须留有间隙作为界分 两类存储设备 顺序存取存储设备，其严格依赖信息的物理位置次序进行定位和读写的存储设备（如磁带、光盘等） 直接存取存储设备，又叫随机存取存储设备（磁盘） 逻辑文件(又称文件的逻辑结构) 流式文件：指文件内的数据不再组成记录，只是由一串依次的字节组成的信息流序列(即内容没有结构的文件) 记录式文件：是一种有结构的文件，它是若干逻辑记录信息所组成的记录流文件(如公司员工的工资表文件) 记录式文件与数据库 数据库文件也支持逻辑记录，但数据库之间的记录可以通过某种联系进行数据查询，而记录式文件不支持文件之间的联系 文件的物理结构 文件的物理结构和组织是指文件在物理存储空间中的存放方法和组织关系 四种文件 顺序文件：将一个文件中逻辑上连续的信息存放到存储介质的依次相邻的块中便形成顺序结构，这类文件叫顺序文件，又称连续文件(磁盘上的歌曲，视频文件) 优点：顺序存取记录时速度较快 缺点：建立文件前需要能预先确定文件长度，以便分配存储空间；修改、插入和增加文件记录有困难 连接文件：又称串联文件，连接结构的特点是使用连接字来表示文件中各个物理块之间的先后次序 优点：易于增删改，动态增加记录，不必预先知道文件长度，存储空间利用率高 缺点：存放指针需额外空间，但由于存取须通过缓冲区，待获得连接字后才能找到下一个物理块地址，仅适用于顺序存取 直接文件：又称散列文件，通过计算记录的关键字建立与其物理存储地址之间的对应关系，通常采用hash法 索引文件：为每个文件建立一张索引表，每个表目包含一个记录的键和存储地址，索引表的地址可由文件目录指出，其文件结构分为索引区和数据区，访问需先查找索引表，再获得记录物理地址 优点：综合了顺序文件和连接文件的优点 缺点：增加了索引表的空间开销和查找时间（多级索引结构）","link":"/2020/02/24/%E8%AE%A1%E7%AE%97%E6%9C%BA%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"},{"title":"对肺炎疫情的思考","text":"       如果上一次的非典我没有什么印象或者感受的话，那么这一次的新型冠状病毒我是真的感受真切了，从一开始的不重视，到后来的心随着人数曲线而跳动，祖国再次展示了她的强大。&emsp;       虽然因为疫情，限制了我们的出行，限制了非常多在过年之际本该团聚的活动，但是相比战斗在一线的医生，我们是轻松的；相比受到感染的病人，我们是幸运的。我们能做的就是听从政府的指挥，帮助祖国战胜这场没有硝烟的战争。但这场疫情中却发生了很多事。&emsp;       从起初的12月30日，全国收到了来自武汉的两封红头文件，是这次疫情的最早信号，落款均为武汉市卫生健康委员会医政医管处的两份红头文件——《关于做好不明原因肺炎救治工作的紧急通知》及《市卫生健康委关于报送不明原因肺炎救治情况的紧急通知》，通知称：“根据上级紧急通知，我市华南海鲜市场陆续出现不明原因肺炎病人。”这个信息被人们知道的时候，感染人群已经有数十人，此后武汉不断出现新的患者，至1月9日，出现了第一例死亡病例，随后国内多地出现肺炎患者，当无武汉接触史的病人出现时，意味着二代病例出现，1月23日10时，武汉宣布“封城”，全国各个城市启动突发事件一级响应，全国人民都在为疫情做着自己应尽的责任。&emsp;       而在这个疫情肆虐的时刻，总有人站在最前线，为祖国挡住了最猛烈的风，他们就是站在一线的医务人员。具有“士不可以不弘毅，任重而道远”的深沉担当的钟南山同志，年高已经84岁，却在疫情发生的第一时刻选择请缨前往战斗的一线；具有“绝知此事要躬行”的专注实干的李兰娟院士，在面对突发不明疫情时，表现了“国家有需要，我们随时出发”态度；具有“向死而生，医者仁心”的奉献大爱的李文亮医生，是冲在一线救治患者的勇士，以自己的积极乐观、无私无畏，再次诠释了白衣天使的平凡与伟大。向那些战斗在一线的人们致敬，他们都是勇士，特别是那些直接面对疫情的医生护士，如此庞大的患者人数，他们必须承担着前所未有的压力，与时间赛跑，与死神斗争，他们应该被世人铭记。&emsp;       但在疫情期间却出现了一些害虫，关于武汉红十字会事件，我不知详情，也不知最后结果，但却不难主观的感受到，武汉红十字会在这次疫情中没有干什么好事，关于一些医用资源的捐赠分配，可能也是导致令人痛惜的医疗人员感染事件发生的原因之一，而那些造谣的人也非常的可恶，动摇着群众的信心。“比疫情更可怕的是人们的言论”，对的，没有什么疫情是不可战胜的，有时候言论比病毒更致命，让人们陷入恐慌的往往不是事情本身，而是他人的妄语之词，每次灾难都会出现谣言，但庆幸的是，每次都是真理战胜了谣言。&emsp;       不得不说这次的疫情比起非典来说传播的更厉害，如果非要说为什么传播的这么快，一方面是因为春运，一方面是因为现在网络更发达了。但好在在党的指挥下，在政府的帮助下，在全国人民的齐心协力下，这次疫情没有再传播下去，现在的疫情基本得到控制，战胜疫情是迟早的。&emsp;       “一个有希望的民族不能没有英雄，一个有前途的国家不能没有先锋。”战“疫”先锋，是新时代中华民族的脊梁。战“疫”大军，在先锋的感召下奔涌向前，相信经过这个疫情，会使我们祖国变得更加强大，经过这次磨炼，会使我们更加坚强。","link":"/2020/02/27/%E5%AF%B9%E8%82%BA%E7%82%8E%E7%96%AB%E6%83%85%E7%9A%84%E6%80%9D%E8%80%83/"},{"title":"计算机组成原理","text":"总括内容一、计算机组成原理之机器 计算机系统的基本概念 总线 存储器 输入输出系统 二、计算机组成原理之数字 计算机中数的表示 计算机的运算方法和运算器 三、计算机组成原理之CPU 指令系统 CPU的结构和功能 控制单元 控制单元的设计 计算机语言层次的划分: 高级语言→汇编语言→操作系统→机器语言→微指令系统 现代计算机硬件组成即冯诺依曼计算机： 关于主机的内置结构(例子模型)在CPU中分为运算器和控制器 ACC，X，MQ为CPU中的存储单元，ALU为算数逻辑单元，CU为控制单元，PC为程序计数器，保存当前欲执行指令的地址，并触发后指向下一个指令的地址，IR为指令寄存器，为保存当前欲执行的指令。 在主存储器中分为存储体M，MAR，MDR 存储体中保存全部数据,以及地址，MAR为主存地址寄存器，MDR为主存数据寄存器 指令格式：操作码+地址码控制器执行一条指令的步骤包括：取指令，分析指令，执行指令 根据结构图来详细的描述一下一条指令是如何在主机内运行的 取数指令：PC中存放有取数指令的地址，第一步PC把改指令地址发送给MAR由其拿着地址去存储体中找到地址对应的指令数据，存储体把指令数据发送给MDR由其把指令发送到CPU中的指令寄存器IR，IR得到指令后把指令发送给控制单元CU，经CU分析处理把内存单元ACC的地址和指令反馈给IR，由IR把内存单元地址发送给MAR，再发送给存储体，在控制器的控制下从存储体从把数发送给MDR，由其发送给内存单元ACC。 根据上例可自行推出。 根据上诉可延展例子 具体过程不再赘述。 总线 总线：总线是连接各个部件的信息传输线，是各个部件共享的传输介质。 总线的分类: 片内总线：芯片内部的总线 系统总线：计算机各部件之间的信息传输总线 通信总线：用于计算机系统之间或计算机系统与其他系统（如控制仪表、移动通信等）之间的通信 总线的特性: 机械特性：尺寸、形状、管脚数及排列顺序 电气特性：传输方向和有效电平范围 功能特性：每根传输线的功能{地址、数据、控制} 时间特性：信号的时序关系 总线标准: 总线结构: 总线判优控制:①集中式{链式查询、计数器定时查询、独立请求方式}②分布式总线通信控制：目的&gt;&gt;解决通信双方协调配合问题总线通信方式: 同步通信：由统一时标控制数据传送 异步通信：采用应答方式，没有公共时钟标准 半同步通信：同步、异步结合 分离式通信：充分挖掘系统总线每个瞬间的潜力 课程资料: 注:此为笔记，取材于哈尔滨工业大学计算机组成原理网课","link":"/2020/02/21/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BB%84%E6%88%90%E5%8E%9F%E7%90%86/"},{"title":"关《实践论》有感","text":"       《实践论》是毛泽东同志最杰出的哲学著作之一。毛泽东同志在马克思辩证唯物主义的基础上，借用马克思主义的认识论观点揭露党内的教条主义和经验主，结合中国具体的社会实践，深刻地揭示了认识与实践的密切联系。在读完《实践论》全文之后，我对辩证唯物主义有了更为深刻的了解。&emsp;       《实践论》首先说明了认识对生产和阶级斗争的依靠关系，而在马克思主义理论里，人的社会实践其资料正是生产活动、阶级斗争、政治生活科学和艺术的活动等等。因此认识对社会实践同样有着依靠关系。“只有人们的社会实践，才是人们对于外界认识的真理性的标准。”毛泽东同志对于这句话给了更加深刻准确的诠释：在社会实践过程中，人们到达了思想中所预想的结果，于是认识被证实了，如果达不到，就会在实践中失败，在失败中得到教训、改正思想，然后取得成功，此正所谓“失败者成功之母”。透过阐述认识的发展过程，我们能够更清楚地了解到人的认识究竟怎样从实践产生，从而又运用于实践。&emsp;       首先，认识来源与实践。在实践过程中，人们透过自身的感官得出事物的各个表象、各种片面以及事物的外部联系，即对事物的感性认识。然后，随着社会实践的继续，人们抓住了事物的本质、全体以及事物的内部联系，感性认识达成飞跃，成为理性认识。而认识的飞跃，是绝对不能离开实践的。认识的不断深化，无不基于实践这一基础。无产阶级对于资本主义的认识，中国人民对于帝国主义的认识，以及战争的领导者对于战争的认识等等皆是如此。&emsp;       但是，认识的目的不是认识本身，而是用于实践、改造世界。因而认识来源与实践，并要回归实践。辩证唯物论的认识运动，在获得理性认识之后，还有更重要的过程，那便是从理性的认识到指导实践又一个飞跃。透过得来的认识指导实践，并且在实践中检验的发展认识，这是认识过程的继续。理论是否贴合于客观真理性，在由感性到理性的运动过程中是不能完全解决的。要完全地解决，只有“把理性的认识再回到社会实践中去，应用理论于实践，看它是否能够到达预想的目的”。&emsp;       认识运用于实践并得到证实之后，人们对于某一客观过程在某一发展阶段内的认识运动便是完成了，对于过程的推移来说认识并没有完成。事物是不断变化和发展的，实践活动也会跟着变化发展，所以，认识同样要不断变化和发展。某一客观过程在某一发展阶段向另一阶段变化发展时，认识就要继续，就要适应新的状况。客观过程的发展充满着矛盾和斗争，因而人的认识运动的发展同样充满矛盾和斗争；社会实践过程是无穷的，人的认识过程也应当是无穷的。&emsp;       于是，我们得出，在单个对于某一客观过程在某一发展阶段内的认识中，透过实践发现真理，又透过实践证实真理和发展真理。从感性认识能动地发展到理性认识，又从理性认识能动地指导革命实践，改造主观世界和客观世界。&emsp;       《实践论》是毛泽东同志对于实践的正确而系统的见解，对于指导当时的中国革命，指导我们此刻、将来各种实践活动都有着极为深远的好处。我们要认真学习它，并领悟其中的思想，应用于我们的实践，从而使我们更好的参与实践，收获成功。","link":"/2020/02/27/%E5%AF%B9%E5%AE%9E%E8%B7%B5%E8%AE%BA%E7%9A%84%E8%AF%BB%E5%90%8E%E6%84%9F/"}],"tags":[{"name":"笔记","slug":"笔记","link":"/tags/%E7%AC%94%E8%AE%B0/"},{"name":"思政","slug":"思政","link":"/tags/%E6%80%9D%E6%94%BF/"}],"categories":[{"name":"计算机基础","slug":"计算机基础","link":"/categories/%E8%AE%A1%E7%AE%97%E6%9C%BA%E5%9F%BA%E7%A1%80/"},{"name":"作业","slug":"作业","link":"/categories/%E4%BD%9C%E4%B8%9A/"}]}