{"pages":[{"title":"categories","text":"","link":"/categories/index.html"},{"title":"about","text":"","link":"/about/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"contact","text":"","link":"/contact/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/02/18/hello-world/"},{"title":"my first blog","text":"","link":"/2020/02/18/my-first-blog/"},{"title":"计算机操作系统","text":"操作系统(简称OS)：OS是计算机系统最基础的系统软件，管理软硬件资源、控制程序执行，改善人机界面，合理组织计算机工作流程，为用户使用计算机提供良好运行环境操作系统的组成： 进程调度子系统、进程通信子系统、内存管理子系统、设备管理子系统、文件管理子系统、网络通信子系统、作业控制子系统 资源的共享与分配方式： ①资源共享方式：独占使用方式、并发使用方式②资源分配策略： 静态分配方式(在程序运行前事先分配好资源) 动态分配方式(在程序运行中，谁用谁分配资源，可能会产生死锁) 资源抢占方式(设置优先级，优先级高，则随时可使用，不会产生死锁，但需考虑资源回滚) 中断：中断是指程序执行过程中，遇到急需处理的事件时，暂时中止CPU上现行程序的运行，转去执行相应的事件处理程序，待处理完成后再返回源程序被中断处或调度其他程序执行的过程。(中断是激活操作系统的唯一方式) 狭义的中断指来源于处理器之外的中断事件，即与当前运行指令无关的中断事件，如I/O中断、外部信号中断等 异常指当前运行指令引起的中断事件，如地址异常、算数异常、处理器硬件故障等 系统异常指执行陷入指令而触发系统调用引起的中断事件，如请求设备、请求I/O、创建进程等 中断源：处理器硬件故障中断事件、程序性中断事件、自愿性中断事件、I/O中断事件、外部中断事件 程序状态字（Program Status Word, PSW）又称状态寄存器，主要用于反映处理器的状态及某些计算结果以及控制指令的执行。程序状态字通常包括以下状态代码： CPU的工作状态码——指明管态还是目态，用来说明当前在CPU上执行的是操作系统还是一般用户，从而决定其是否可以使用特权指令或拥有其它的特殊权力 条件码——反映指令执行后的结果特征 中断屏蔽码——指出是否允许中断 各标志位的含义如下表格： 进程的概念： 进程是一个具有一定独立功能的程序相关某个数据集合的一次运行活动，也是操作系统进行资源分配和调度的一个独立单位进程包括五个实体： (OS管理运行程序的)数据结构P (运行程序的)内存代码C (运行程序的)内存数据D (运行程序的)通用寄存器信息R (OS控制程序执行的)程序状态字信息PSW 进程挂起：为解决计算机在运行过程中可能出现资源不足(性能低、死锁)，从而剥夺某些进程的内存即其他资源，使其不参加进程调度，挂起态与等待态相比，前者没有任何资源。 关键的进程管理软件： 系统调用/中断/异常处理程序 * 队列管理模块 进程控制程序 * 进程调度程序 进程通信程序 * 作业控制程序等外围程序 队列管理模块： 队列管理模块是操作系统实现进程管理的核心模块 操作系统建立多个进程队列，包括就绪队列和等待队列 按需组织为先进先出队列与优先队列 队列中的进程可以通过PCB中的队列指引元采用单双指引元或索引连接 出队和入队操作 进程与资源调度围绕进程队列展开 进程的控制与管理： 进程创建：进程表加一项，申请PCB并初始化，生成标识，建立映像，分配资源，移入就绪队列 进程撤销：从队列中移除，归还资源，撤销标识，回收PCB，移除进程表项 进程阻塞：保存现场信息，修改PCB，移入等待队列，调度其他进程执行 进程唤醒：等待队列中移除，修改PCB，移入就绪队列 进程挂起：修改状态并出入相关队列，收回内存等资源送至对换区 进程激活：分配内存，修改状态并出入相关队列 其他：如修改进程特权 原语：原语是由若干条指令构成的完成某种特定功能的程序，执行上具有不可分割性 进程控制中涉及对OS核心数据结构的修改，为防止错误，应使用原语。 进程切换：是指进程被某些中断事件中断之后，使其从进行态变成其他状态，在中断事件结束后，切换成其他进程进行。","link":"/2020/02/24/%E8%AE%A1%E7%AE%97%E6%9C%BA%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"},{"title":"计算机组成原理","text":"总括内容一、计算机组成原理之机器 计算机系统的基本概念 总线 存储器 输入输出系统 二、计算机组成原理之数字 计算机中数的表示 计算机的运算方法和运算器 三、计算机组成原理之CPU 指令系统 CPU的结构和功能 控制单元 控制单元的设计 计算机语言层次的划分: 高级语言→汇编语言→操作系统→机器语言→微指令系统 现代计算机硬件组成即冯诺依曼计算机： 关于主机的内置结构(例子模型)在CPU中分为运算器和控制器 ACC，X，MQ为CPU中的存储单元，ALU为算数逻辑单元，CU为控制单元，PC为程序计数器，保存当前欲执行指令的地址，并触发后指向下一个指令的地址，IR为指令寄存器，为保存当前欲执行的指令。 在主存储器中分为存储体M，MAR，MDR 存储体中保存全部数据,以及地址，MAR为主存地址寄存器，MDR为主存数据寄存器 指令格式：操作码+地址码控制器执行一条指令的步骤包括：取指令，分析指令，执行指令 根据结构图来详细的描述一下一条指令是如何在主机内运行的 取数指令：PC中存放有取数指令的地址，第一步PC把改指令地址发送给MAR由其拿着地址去存储体中找到地址对应的指令数据，存储体把指令数据发送给MDR由其把指令发送到CPU中的指令寄存器IR，IR得到指令后把指令发送给控制单元CU，经CU分析处理把内存单元ACC的地址和指令反馈给IR，由IR把内存单元地址发送给MAR，再发送给存储体，在控制器的控制下从存储体从把数发送给MDR，由其发送给内存单元ACC。 根据上例可自行推出。 根据上诉可延展例子 具体过程不再赘述。 总线 总线：总线是连接各个部件的信息传输线，是各个部件共享的传输介质。 总线的分类: 片内总线：芯片内部的总线 系统总线：计算机各部件之间的信息传输总线 通信总线：用于计算机系统之间或计算机系统与其他系统（如控制仪表、移动通信等）之间的通信 总线的特性: 机械特性：尺寸、形状、管脚数及排列顺序 电气特性：传输方向和有效电平范围 功能特性：每根传输线的功能{地址、数据、控制} 时间特性：信号的时序关系 总线标准: 总线结构: 总线判优控制:①集中式{链式查询、计数器定时查询、独立请求方式}②分布式总线通信控制：目的&gt;&gt;解决通信双方协调配合问题总线通信方式: 同步通信：由统一时标控制数据传送 异步通信：采用应答方式，没有公共时钟标准 半同步通信：同步、异步结合 分离式通信：充分挖掘系统总线每个瞬间的潜力 课程资料: 注:此为笔记，取材于哈尔滨工业大学计算机组成原理网课","link":"/2020/02/21/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BB%84%E6%88%90%E5%8E%9F%E7%90%86/"}],"tags":[{"name":"笔记","slug":"笔记","link":"/tags/%E7%AC%94%E8%AE%B0/"}],"categories":[{"name":"计算机基础","slug":"计算机基础","link":"/categories/%E8%AE%A1%E7%AE%97%E6%9C%BA%E5%9F%BA%E7%A1%80/"}]}